{
  "Main": {
    "welcome": "Welcome!!!",
    "welcomeBack": "Welcome back",
    "client": "REST CLIENT",
    "variables": "VARIABLES",
    "history": "HISTORY"
  },
  "Navigation": {
    "signIn": "SIGN IN",
    "signUp": "SIGN UP",
    "signOut": "SIGN OUT",
    "main": "MAIN"
  },
  "NotFoundPage": {
    "title": "Not Found!",
    "message": "Could not find resource!"
  },
  "ErrorPage": {
    "title": "Something went wrong",
    "message": "Error Page",
    "Try again": "Try again"
  },
  "Auth": {
    "login": "login",
    "email": "email",
    "password": "password",
    "confirm password": "confirm password",
    "Submit": "Submit",
    "Registration": "Registration",

    "Enter valid email": "Enter valid email",
    "Password must be at least 8 characters long": "Password must be at least 8 characters long",
    "Password must contain at least one number": "Password must contain at least one number",
    "Password must contain at least one uppercase letter": "Password must contain at least one uppercase letter",
    "Password must contain at least one lowercase letter": "Password must contain at least one lowercase letter",
    "Password must contain at least one special character": "Password must contain at least one special character",
    "Passwords do not match": "Passwords do not match",
    "Invalid login credentials": "Invalid login credentials"
  },
  "About": {
    "about": "About",
    "project1": "PUTMAN is a universal testing, development, and REST API platform. It provides a clean interface that replaces disparate tools like Postman, Curl, and the command line, bringing together everything you need to work with an API into one powerful yet simple web application.",
    "project2": "PUTMAN is positioned as a 'Swiss knife' for backend developers, QA engineers and API designers. Unlike heavy desktop applications, PUTMAN works directly in the browser, without requiring installation, and offers a modern, minimalist UI.",
    "project3": "The key idea is not just to send requests, but to manage the entire life cycle of interaction with the API: from writing and debugging individual requests to organizing collections, automated testing, documentation and monitoring the health (health check) of your services.",
    "rs": "We would like to express our gratitude to RS school and all its staff for giving us the opportunity to try something new and interesting. Thank you for your time. Special thanks to our mentors who helped and motivated us on this long, difficult, but incredibly exciting path.",
    "author1Name": "Dmitry Starchenko",
    "author1Description": "Hello, my name is Dima, I am 33 years old, I am from Gomel (Belarus). My first attempts to create a website were in my school years. I abandoned this idea and did something else. And now, many years later, I decided to make my dream come true...",
    "author2Name": "Roma Bubnov",
    "author2Description": "Hello. My name is Roma Bubnov. I graduated from the Saratov State Conservatory with a degree in music performance. My fascination with programming started around 2019. Like many people, I was curious about the world behind the software we use every day. My first programming language was Java, but i quickly found that JavaScript resonated with me in a way that Java hadn&apos;t initially. I think it was the dynamic nature of the language and its versatility. In the final project, my team and I decided to try our hand at React; it is on studying this JavaScript library that I would like to focus further development.",
    "author3Name": "Husan Abdigafurov",
    "author3Description": "Hello, my name is Husan. I am interested in frontend and backend, I like to understand the architecture of applications and learn new things. I am always open to new knowledge and experiments."
  }
}
