{
  "Main": {
    "welcome": "Здравствуйте!!!",
    "welcomeBack": "С возвращением!!!",
    "client": "REST КЛИЕНТ",
    "variables": "ПЕРЕМЕННЫЕ",
    "history": "ИСТОРИЯ"
  },
  "Navigation": {
    "signIn": "ВХОД",
    "signUp": "РЕГИСТРАЦИЯ",
    "signOut": "ВЫХОД",
    "main": "ГЛАВНАЯ"
  },
  "NotFoundPage": {
    "title": "Не найдено!",
    "message": "Ресурс не найден!"
  },
  "ErrorPage": {
    "title": "Что-то пошло не так",
    "message": "Страница ошибки",
    "Try again": "Попробовать снова"
  },
  "Auth": {
    "login": "логин",
    "email": "эл. почта",
    "password": "пароль",
    "confirm password": "подтвердить пароль",
    "Submit": "Подтвердить",
    "Registration": "Регистрация",
    "Enter valid email": "Введите корректный email",
    "Password must be at least 8 characters long": "Пароль должен содержать не менее 8 символов",
    "Password must contain at least one number": "Пароль должен содержать хотя бы одну цифру",
    "Password must contain at least one uppercase letter": "Пароль должен содержать хотя бы одну заглавную букву",
    "Password must contain at least one lowercase letter": "Пароль должен содержать хотя бы одну строчную букву",
    "Password must contain at least one special character": "Пароль должен содержать хотя бы один специальный символ",
    "Passwords do not match": "Пароли не совпадают",
    "Invalid login credentials": "Неверные данные для входа"
  },
  "About": {
    "about": "О нас",
    "project1": "PUTMAN — универсальная платформа для тестирования, разработки и REST API. Она предоставляет понятный интерфейс, который заменяет разрозненные инструменты, такие как Postman, Curl и командная строка, объединяя всё необходимое для работы с API в одном мощном, но простом веб-приложении.",
    "project2": "PUTMAN позиционируется как «швейцарский нож» для бэкенд-разработчиков, специалистов по тестированию и проектировщиков API. В отличие от тяжёлых десктопных приложений, PUTMAN работает прямо в браузере, не требуя установки, и предлагает современный минималистичный пользовательский интерфейс.",
    "project3": "Ключевая идея — не просто отправка запросов, а управление всем жизненным циклом взаимодействия с API: от написания и отладки отдельных запросов до организации коллекций, автоматизированного тестирования, документирования и мониторинга работоспособности (health check) ваших сервисов.",
    "rs": "Мы хотели бы выразить благодарность школе RS и всем её сотрудникам за предоставленную нам возможность попробовать что-то новое и интересное. Спасибо за уделённое нам время. Особая благодарность нашим наставникам, которые помогали и мотивировали нас на этом долгом, сложном, но невероятно увлекательном пути.",
    "author1Name": "Дмитрий Старченко",
    "author1Description": "Здравствуйте, меня зовут Дима, мне 33 года, я из Гомеля (Беларусь). Мои первые попытки создать сайт еще были в школьные годы. Я забросил эту идею и занялся чем то другим. И вот спустя много лет, решил воплотить в жизнь свою мечту...",
    "author2Name": "Рома Бубнов",
    "author2Description": "Здравствуйте! Меня зовут Рома Бубнов. Я окончил Саратовскую государственную консерваторию по специальности «музыкальное исполнительство». Моё увлечение программированием началось примерно в 2019 году. Как и многим, мне было интересно узнать, что же скрывается за программным обеспечением, которое мы используем каждый день. Моим первым языком программирования была Java, но я быстро обнаружил, что JavaScript нашёл во мне отклик, которого Java поначалу не находил. Думаю, всё дело в динамичности этого языка и его универсальности. В последнем проекте мы с командой решили попробовать себя в React; именно на изучении этой JavaScript-библиотеки я хотел бы сосредоточиться в своей дальнейшей разработке.",
    "author3Name": "Хусан Абдигафуров",
    "author3Description": "Привет, меня зовут Хусан. Я интересуюсь фронтендом и бэкендом, люблю разбираться в архитектуре приложений и узнавать новое. Я всегда открыт для новых знаний и экспериментов."
  }
}
